// 1. Виведіть користувачу попап використовуючи функцію "alert" який містить довільне повідомлення.
alert('pivasik')

// 2. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
let age = prompt('How old are you?')
console.log(age)

// 3. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і має дефолтнe значення "13". Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
let age = prompt('How old are you?', 30)
console.log(age)

// 4. Виведіть користувачу попап використовуючи функцію "confirm" який містить довільне питання. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою  "console.log"
let pivasik = confirm('Budesh pivasik?')
console.log(pivasik)

// 5. Виведіть користувачу попап використовуючи функцію "confirm" який містить довільне питання. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "if" виведіть в консоль "1" якщо відповідь на питання була позитивна
let pivasik = confirm('Budesh pivasik?')
console.log(pivasik)

if (pivasik) {
	console.log(1)
}

// 6. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "if else" виведіть в консоль "1" або "2"
let pivasik = prompt('Budesh pivasik?')
console.log(pivasik)
if (pivasik < 2) {
	console.log(1)
} else {
	console.log(2)
}

// 7. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "if else" виведіть в консоль "1" або "2" або "3"
let pivasik = prompt('Budesh pivasik?')
console.log(pivasik)

if (pivasik < 2) {
	console.log(1)
} else if (pivasik == 2) {
	console.log(2)
} else {
	console.log(3)
}

// 8. Виведіть користувачу попап використовуючи функцію "confirm" який містить довільне питання. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "switch" виведіть в консоль "1" якщо відповідь на питання була позитивна
let pivasik = confirm('Budesh pivasik?')
console.log(pivasik)

switch (value) {
	case 1: {
		console.log(1)
	}
}

// 9. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "switch" виведіть в консоль "1" або "2"
let age = prompt('How old are you?')
console.log(age)

switch (age) {
	case '1': {
		console.log(1)
		break
	}
	default: {
		console.log(2)
		break
	}
}


// 10. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "switch" виведіть в консоль "1" або "2" або "3"
let age = prompt('How old are you?')
console.log(age)

switch (age) {
	case '1': {
		console.log(1)
		break
	} case '2': {
		console.log(2)
		break
	} case '3': {
		console.log(3)
	}
}




// 11. Виведіть користувачу попап використовуючи функцію "prompt" який містить довільне питання і не має дефолтного значення. Результат присвойте у змінну.
// *Виведіть змінну в консоль за допомогою "console.log"
// *Використовуючи "switch" виведіть в консоль "1" або "2" або "3", виконайте те саме за допомогою "if else";
// *Зробіть два різні приклади

let age = prompt('How old are you?')
console.log(age)

switch (age) {
	case '1': {
		console.log(1)
		break
	} case '2': {
		console.log(2)
		break
	} case '3': {
		console.log(3)
	}
}

if (age < 2) {
	console.log(1)
} else if (age == 2) {
	console.log(2)
} else {
	console.log(3)
}